
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "Изменилась цена";	
	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстСообщения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "Изменилось количество";		
	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстСообщения);	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка, Текст)
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();
	
	Пользователь = ОписаниеЧеловека();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Пользователь.Имя;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеЧеловека()
	
	Сотрудник = Новый Структура;
	Сотрудник.Вставить("Имя", "Елена");
	Сотрудник.Вставить("ДатаРождения", ТекущаяДата());
	Сотрудник.Вставить("ВШтате", Истина);
	Сотрудник.Вставить("Стаж", 15);
	Возврат Сотрудник;
	
КонецФункции

#КонецОбласти





